src/Documents/КАЗ_АннулированиеЗаявки/КАЗ_АннулированиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_АннулированиеЗаявки</name>
  <registerRecords>AccumulationRegister.КАЗ_ПлановыеПлатежи</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.КАЗ_ПричиныОтклоненияЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ПлановыеПлатежи/КАЗ_ПлановыеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ПлановыеПлатежи</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_АннулированиеЗаявки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не выбрана заявка для аннулирования.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбъектЗаявки = Заявка.ПолучитьОбъект();

	Если ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена Тогда
		Сообщить("Нельзя аннулировать уже оплаченную заявку.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ПлановыеПлатежи.Записывать = Истина;

	Движение = Движения.КАЗ_ПлановыеПлатежи.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Заявка = Заявка;
	Движение.Контрагент = ОбъектЗаявки.Контрагент;
	Движение.СтатьяПлатежа = ОбъектЗаявки.СтатьяПлатежа;
	Движение.ЦФО = ОбъектЗаявки.ЦФО;
	Движение.Сумма = ОбъектЗаявки.СуммаДокумента;

	ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Отменена;
	ОбъектЗаявки.Записать();

КонецПроцедуры
